<html>
	<head>
		<title>Primeros pasos con scratch...</title>
		<link rel="stylesheet" type="text/css" href="estilo.css">
	</head>
	<body>
		<div id="contenido">
			<p>
				<h1 id="titulo"> ¿Qu&eacute; es Scratch?</h1>
			</p>
			<br>
			<p  id="p_acerca"> Scratch es tanto una aplicación que podemos descargar a nuestro ordenador (está disponible para varios sistemas operativos: Windows, Ubuntu, Sugar, Mac) como una aplicación web que podemos ejecutar desde nuestro navegador.</p>
			<p id="p_acerca">En ambos casos tenemos por un lado una serie de objetos o “sprites” (en la nomenclatura que utiliza de Scratch) y por otro lado una serie de acciones y comportamientos que podemos combinar para conseguir que los objetos reaccionen a actúen de una determinada manera. </p>
			<p id="p_acerca">Una de las cosas m&aacute;s interesantes de Scratch es que esas acciones o comportamientos tienen forma de puzzle y nuestra misión como programadores será cocinar esas piezas para conseguir un determinada acción o comportamiento. As&iacute; que en esencia programa se convierte en algo parecido a resolver un puzzle, lo que elimina una de las principales barreras que tienen los ne&oacute;fitos en el mundo de la programaci&oacute;n que es el aspecto &aacute;rido y complejo de los entornos de programaci&oacute;n. Convirtiendo el proceso de programar en algo parecido a un juego. </p>
<div align="center"><iframe width="560" height="315" src="https://www.youtube.com/embed/Z_uHtpR9Ims" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe></div>
			<p id="p_acerca">Las acciones y comportamientos están divididas en categorías y son estas: </p>
			<div align="center"><iframe src="https://docs.google.com/viewer?srcid=14CQjATs1KZ1VOt34KXxYDtcqHhjqsdCI&pid=explorer&efh=false&a=v&chrome=false&embedded=true" width="60%" height="100%"></iframe></div>
			<p>
				<h1 id="titulo"> ¿Para qu&eacute; sirve?</h1>
			</p>
			<p id="p_acerca"> 
				<ul>
					<li>Permite el desarrollo de los procesos de pensamientos y habilidades mentales en los educandos. </li>
					<li>Es perfecto para introducirse en la programaci&oacute;n. </li>
					<li>Permite compartir los proyectos a trav&eacute;s del web, se pueden descargar y utilizar. Pudiendo ser descargados y utilizados por otras personas</li>
				</ul>
			</p>
			<p>
				<h1 id="titulo"> ¿Por qu&eacute; Scratch?</h1>
			</p>

			<p id="p_acerca">La programaci&oacute;n es el el nuevo lenguaje que todos necesitamos conocer si queremos tener una buena comprensión del mundo actual y sobre todo del que viene as&iacute; como buenas oportunidades laborales. se calcula que cerca del 50% de los puestos de trabajo que conocemos hoy en d&iacute;a desaparecer&aacute;n y en buena medida ser&aacute;n sustituidos por la industria del software y al robótica. De este modo Scratch se convierte en una gran herramienta para comprender los conceptos y la l&oacute;gica de la programaci&oacute;n. adem&aacute;s lo hace abordando su aprendizaje desde un punto de vista lúdico para evitar el rechazo inicial que para muchas personas suponen los entornos de programaci&oacute;n m&aacute;s cl&aacute;sicos. </p>
			<p>
				<h1 id="titulo"> Ventajas para el desarrollo del ni&ntilde;o</h1>
			</p>

			<p id="p_acerca">Si hay un entorno en el que Scratch esta especialmente indicado, es en el de la ense&ntilde;anza de la programación a los ni&ntilde;os, por ese componente lúdico del que hemos hablado antes. Podr&iacute;amos agrupar una serie de ventajas que su uso proporciona a los ni&ntilde;os: </p>
			<p id="p_acerca"> 
				<ul>
					<li>Desarrollar el pensamiento l&oacute;gico. </li>
					<li>Desarrollar m&eacute;todos para solucionar problemas de manera metódica y ordenada. </li>
					<li>Desarrollar el h&aacute;bito de hacer autodiagnosis con respecto a su trabajo.</li>
				
					<li>Desarrollar la capacidad de poner en duda las ideas de uno mismo.</li>
				
					<li>Tener la posibilidad de obtener resultados complejos a partir de ideas simples.</li>
				
					<li>Trabajar cada cual a su ritmo en funci&oacute;n de sus propias competencias</li>
				
					<li>Usar distintos medios: sonido, imagen, texto, gr&aacute;fico…</li>
				
					<li>Posibilitar el aprendizaje colaborativo a través del intercambio de conocimiento</li>
				</ul>
			</p>

			<br>
			<p  id="p_acerca"> A continuación se muestra una práctica explicada paso a paso para la elaboración de una aplicaci&oacute;n interactiva en Scratch. Para observar el resultado y que puedas probarlo, visita la parte de "Ejemplos básicos"</p>
			<div align="center"><iframe src="https://docs.google.com/viewer?srcid=1ojNFVBgmQe2GHJ6CMMYgIuzNuAC8yAus&pid=explorer&efh=false&a=v&chrome=false&embedded=true" width="60%" height="100%"></iframe></div>

			<p id="p_acerca"> Referencia: </p>
			<p id="p_acerca"> A. (2020a, marzo 25). ¿Qué es Scratch? y ¿Para qué sirve? Garaje Imagina. https://garajeimagina.com/es/que-es-scratch-y-para-que-sirve/</p>
		</div>
	</body>
</html>